Repository: mondeja/shread
Catalog: src/__compendium/*.po
Languages: es

source: Error code
es: Código de error

source: Not found
es: No encontrado

source: An error happen retrieving Google Drive releases information from Github API.
es: Ocurrió un error obteniendo la información de las releases de Google Drive de la API de Github.

source: An error happen parsing the penultimate Google Drive release version from Github API.
es: Ocurrió un error parseando la versión de la penúltima release de Google Drive de la API de Github.

source: An error happen retrieving last Google Drive release version.
es: Ocurrió un error obteniendo la versión de la última release de Google Drive.

source: An error happen downloading Google Drive
es: Ocurrió un error descargando Google Drive

source: Checking Google Drive client...
es: Comprobando el cliente Google Drive...

source: Retrieving last available version...
es: Obteniendo la última versión disponible...

source: Downloading Google Drive client...
es: Descargando el cliente de Google Drive...

source: Updating Google Drive
es: Actualizando Google Drive

source: Google Drive found installed in the system
es: Encontrado Google Drive instalado en el sistema

source: Path where the downloaded 'gdrive' binary will be stored. As default at '$_GDRIVE_BINARY_PATH'.
es: Ruta donde será almacenado el binario 'gdrive' descargado. Por defecto en '$_GDRIVE_BINARY_PATH'.

source: Checking Dropbox environment...
es: Comprobando entorno Dropbox...

source: Dropbox found installed in the system
es: Encontrado Dropbox instalado en el sistema

source: Checking if is updated...
es: Comprobando si está actualizado...

source: Updating Dropbox
es: Actualizando Dropbox

source: Retrieving last Dropbox version...
es: Obteniendo la última versión de Dropbox...

source: Downloading Dropbox
es: Descargando Dropbox

source: Installing Dropbox
es: Instalando Dropbox

source: Installs and/or optionally updates Dropbox retrieving release package from their official repository.
es: Instala y/o, opcionalmente, actualiza Dropbox obteniendo el paquete de lanzamiento de su repositorio oficial.

source: Upgrades Dropbox to the latest release available.
es: Actualiza Dropbox a la última versión disponible.

source: An error happen retrieving Docker Compose releases info from Github API.
es: Ocurrió un error obteniendo la información de las releases de Docker de la API de Github.

source: An error happen parsing the penultimate Docker Compose releases version from Github API.
es: Ocurrió un error parseando la penúltima versión de las releases de Docker Compose de la API de Github.

source: An error happen retrieving last Docker Compose version from Github API.
es: Ocurrió un error obteniendo la última versión de Docker Compose de la API de Github.

source: An error happen downloading Docker Compose
es: Ocurrió un error descargando Docker Compose

source: Downloading Docker Compose
es: Descargando Docker Compose

source: Docker Compose found installed in the system
es: Encontrado Docker Compose instalado en el sistema

source: Updating Docker Compose
es: Actualizando Docker Compose

source: Installs or upgrade Docker Compose retrieving source code from their Github repository.
es: Instala o actualiza Docker Compose obteniendo el código fuente de su repositorio de Github.

source: Checking Docker Community Edition...
es: Comprobando Docker Community Edition...

source: Setting up public key...
es: Configurando la clave pública...

source: An error happen retrieving Docker repositories key
es: Ocurrió un error obteniendo la clave de los repositorios de Docker

source: Public key configured found
es: Encontrada la clave pública configurada

source: Adding Docker repository...
es: Añadiendo repositorio de Docker...

source: Docker repository configured found
es: Encontrado repositorio de Docker configurado

source: Checking Docker CE packages...
es: Comprobando paquetes de Docker CE...

source: Installs Docker Community Edition packages from oficial repositories as source.
es: Instala los paquetes de Docker Community Edition desde los repositorios oficiales como fuente.

source: Checking Chrome ecosystem...
es: Comprobando ecosistema Chrome...

source: Is not possible to install Google Chrome on 32 bits systems.
es: No es posible instalar Google Chrome en sistemas de 32 bits.

source: Installing Google Chrome...
es: Instalando Google Chrome...

source: Google Chrome found installed
es: Encontrado Google Chrome instalado

source: Installing chromedriver
es: Instalando chromedriver

source: Updating chromedriver
es: Actualizando chromedriver

source: Chromedriver found installed
es: Encontrado chromedriver instalado

source: Installs and upgrade Chrome and Chromedriver retrieving binaries from oficial sources.
es: Instala y actualiza Chrome y Chromedriver obteniendo los binarios de las fuentes oficiales.

source: Specifies where be stored the downloaded 'chromedriver' binary. As default at '$_CHROMEDRIVER_PATH'.
es: Especifica donde será almacenado el binario 'chromedriver' descargado. Por defecto en '$_CHROMEDRIVER_PATH'.

source: If passed, does not download nor updates chromedriver.
es: Si se pasa, no descarga ni actualiza chromedriver.

source: Setting up NodeJS ecosystem...
es: Configurando ecosistema NodeJS...

source: Checking base dependencies...
es: Comprobando dependencias base...

source: Retrieving lastest absolute NodeJS version...
es: Obteniendo última versión absoluta de NodeJS...

source: Installing NodeJS
es: Instalando NodeJS

source: Uninstalling NodeJS
es: Desinstalando NodeJS

source: An error happen installing NodeJS
es: Ocurrió un error instalando NodeJS

source: Your distribution is not supported by this NodeJS installation script
es: Tu distribución no está soportada por este script de instalación de NodeJS

source: Found NodeJS installed
es: Encontrado NodeJS instalado

source: NodeJS is updated
es: NodeJS está actualizado

source: NodeJS was installed by an unknown source and can not be upgraded.
es: NodeJS fue instalado por una fuente desconocida y no puede ser actualizado.

source: Uninstall NodeJS manually before run this script.
es: Desinstala NodeJS manualmente antes de ejecutar este script.

source: Installs NodeJS using 'github.com/nodesource/distributions' repositories as source.
es: Instala NodeJS usando los repositorios 'github.com/nodesource/distributions' como fuente.

source: Major version of NodeJS to install or update to. As default the latest version available.
es: Versión mayor de NodeJS a instalar o a la que actualizar. Por defecto la última versión disponible.

source: Upgrades NodeJS version if was previouly installed by the same source used by this script.
es: Actualiza la versión de NodeJS si fue instalada previamente por la misma fuente usada por este script.

source: Setting up Python3 ecosystem...
es: Configurando ecosistema Python3...

source: Installing base package
es: Instalando paquete base

source: Found Python3 installed in the system
es: Encontrado Python3 instalado en el sistema

source: Checking additional Python packages...
es: Comprobando paquetes de Python adicionales...

source: Updating global Python3 libraries...
es: Actualizando bibliotecas de Python3 globales...

source: + In Ubuntu >= 18 installs also:
es: + En Ubuntu >= 18 instala también:

source: + In Ubuntu < 20 installs also:
es: + En Ubuntu < 20 instala también:

source: + In Ubuntu >= 20 installs also:
es: + En Ubuntu >= 20 instala también:

source: Optionally, installs or upgrade using PIP some Python3 packages globally:
es: Opcionalmente, instala o actualiza globalmente usando PIP algunos paquetes de Python3:

source: Ignores the installation or upgrade of the global Python3 packages using PIP.
es: Ignora la instalación o actualización de los paquetes globales de Python3 usando PIP.

source: Pass a comma separated list of packages to skip APT package installations.
es: Pasa una lista de paquetes APT separados por comas para ignorar sus instalaciones.

source: Pass a comma separated list of packages to skip Python global package installations.
es: Pasa una lista de paquetes globales de Python separados por comas para ignorar sus instalaciones.

source: Adding repository...
es: Añadiendo repositorio...

source: An error happen retrieving PostgreSQL public key
es: Ocurrió un error obteniendo la clave pública de PostgreSQL

source: Updating packages...
es: Actualizando paquetes...

source: Removing previous packages...
es: Eliminando paquetes anteriores...

source: Retrieving lastest stable available version...
es: Obteniendo la última versión estable disponible...

source: Checking version available
es: Comprobando versión disponible

source: Version not available at official PostgreSQL repositories
es: Versión no disponible en los repositorios de PostgreSQL oficiales

source: The version of Postgis that you're trying to install
es: La versión de Postgis que estás intentando instalar

source: doesn't exists as APT package for PostgreSQL
es: no existe como un paquete APT para PostgreSQL

source: the package
es: el paquete

source: doesn't exists in PostgreSQL official repositories.
es: no existe en los repositorios oficiales de PostgreSQL.

source: Specify an existent version between the next using the param '--postgis-version':
es: Especifica una versión existente de entre las siguientes usando el parámetro '--postgis-version':

source: Checking the configuration of the service 'postgresql'...
es: Comprobando la configuración del servicio 'postgresql'...

source: Enabling...
es: Habilitando...

source: It's enabled
es: Está habilitado

source: An error happen enabling 'postgresql' service.
es: Ocurrió un error habilitando el servicio 'postgresql'.

source: Exit code
es: Código de salida

source: Launching...
es: Ejecutando...

source: The 'postgresql' service couldn't be started.
es: El servicio 'postgresql' no pudo ser iniciado.

source: It's on state
es: Se encuentra en estado

source: It's running
es: Esta en ejecución

source: Installing PostgreSQL...
es: Instalando PostgreSQL...

source: Installing packages...
es: Instalando paquetes...

source: Checking PostgreSQL environment...
es: Comprobando entorno PostgreSQL...

source: Checking packages...
es: Comprobando paquetes...

source: Your version of Debian/Ubuntu is not supported by official PostgreSQL repositories
es: Tu versión de Debian/Ubuntu no está soportada por los repositorios oficiales de PostgreSQL

source: Installs PostgreSQL packages and, optionally, some additional packages from official sources.
es: Instala los paquetes PostgreSQL y, opcionalmente, algunos paquetes adicionales desde fuentes oficiales.

source: Also checks if the 'postgres' service is running and enables it, if is not already.
es: También comprueba si el servicio 'postgres' está en ejecución y lo habilita, si no lo está ya.

source: PostgreSQL version to install. If not provided, the latest version available in repositories will be installed.
es: Versión de PostgreSQL a instalar. Si no se provee, será instalada la última versión disponible en los repositorios.

source: Install Postgis package correspondent to the PostgreSQL version to install.
es: Instala el paquete de PostGIS correspondiente a la versión de PostgreSQL a instalar.

source: Specifies what version of PostGIS will be installed. Only has effect passing '--install-postgis' option.
es: Especifica qué versión de PostGIS será instalada. Sólo tiene efecto pasando la opción '--install-postgis'.

source: If not provided, will be installed the latest available version of the package.
es: Si no se provee, será instalada la última versión disponible del paquete.

source: Install latest version available of 'pgadmin' package.
es: Instala la última versión disponible del paquete 'pgadmin'.

source: Install latest version available of 'postgresql-plpython3-*' package.
es: Instala la última versión disponible del paquete 'postgresql-plpython3-*'.

source: Do not check that the service is configured to run at boot time.
es: No comprueba que el servicio está configurado para ejecutarse al arrancar.

source: An error happen retrieving Boostnote releases info from Github API.
es: Ocurrió un error obteniendo la información de las releases de Boostnote de la API de Github.

source: An error happen parsing penultimate Boostnote release from Github API.
es: Ocurrió un error parseando la penúltima release de Boostnote de la API de Github.

source: An error happen retrieving last Boostnote version.
es: Ocurrió un error obteniendo la última versión de Boostnote.

source: An error happen downloading Boostnote
es: Ocurrió un error descargando Boostnote

source: Checking Boostnote...
es: Comprobando Boostnote...

source: Downloading Boostnote
es: Descargando Boostnote

source: Installing Boostnote
es: Instalando Boostnote

source: Boostnote found installed on the system
es: Encontrado Boostnote instalado en el sistema

source: Updating Boostnote
es: Actualizando Boostnote

source: Installs and/or optionally updates Boostnote retrieving source code from their Github repository.
es: Instala y/o, opcionalmente, actualiza Boostnote obteniendo el código fuente de su repositorio de Github.

source: Updates Boostnote to the penultimate release available.
es: Actualiza Boostnote al penúltimo lanzamiento disponible.

source: Checking Mozilla ecosystem...
es: Comprobando ecosistema Mozilla...

source: Mozilla Firefox found installed in the system
es: Econtrado Mozilla Firefox instalado en el sistema

source: Installing Mozilla Firefox packages
es: Instalando paquetes de Mozilla Firefox

source: Geckodriver found installed in the system
es: Encontrado Geckodriver instalado en el sistema

source: Installing geckodriver...
es: Instalando geckodriver...

source: Installs Mozilla Firefox and geckodriver.
es: Instala Mozilla Firefox y geckodriver.

source: If passed, doesn't installs geckodriver.
es: Si se pasa, no instala geckodriver.

source: Installing CircleCI
es: Instalando CircleCI

source: Updating CircleCI
es: Actualizando CircleCI

source: CircleCI found installed
es: Encontrado CircleCI instalado

source: Downloads or upgrade CircleCI binary.
es: Descarga o actualiza el binario de CircleCI.

source: is already installed
es: ya se encuentra instalado

source: Checking Atom...
es: Comprobando Atom...

source: An error happen rerieving Atom public key:
es: Ocurrió un error obteniendo la clave pública de Atom:

source: Atom found
es: Atom encontrado

source: Running installation script...
es: Ejecutando script de instalación...

source: An error happen installing Atom
es: Ocurrió un error instalando Atom

source: Installs Atom using https://packagecloud.io/AtomEditor repository as source.
es: Instala Atom usando el repositorio https://packagecloud.io/AtomEditor como fuente.

source: Setting up Redis ecosystem...
es: Configurando ecosistema Redis...

source: Retrieving lastest stable version...
es: Obteniendo la última versión estable disponible...

source: An error happen retrieving lastest stable Redis version from file
es: Ocurrió un error obteniendo la última versión estable disponible de Redis del archivo

source: Versions found:
es: Versiones encontradas:

source: Downloading Redis
es: Descargando Redis

source: Building source code...
es: Construyendo el código fuente...

source: Testing build...
es: Testeando la construcción...

source: Checking 'redis' service configuration...
es: Comprobando configuración del servicio 'redis'...

source: An error happen enabling 'redis' service.
es: Ocurrió un error habilitando el servicio 'redis'.

source: Executing...
es: Ejecutando...

source: The 'redis' service could not be started.
es: El servicio 'redis' no pudo ser iniciado.

source: It's runnning
es: Se encuentra en ejecución

source: Creating 'redis' service...
es: Creando servicio 'redis'...

source: Creating 'redis' user...
es: Creando usuario 'redis'...

source: Unzipping...
es: Descomprimiendo

source: Installing Redis
es: Instalando Redis

source: Updating Redis
es: Actualizando Redis

source: Found Redis installed
es: Encontrado Redis instalado

source: Installs or updates Redis building from source code. Also, generates and configures the 'redis' user and service.
es: Instala o actualiza Redis construyendo desde código fuente. También genera y configura el usuario y el servicio 'redis'.

source: If passed, Redis build will be tested. This could take a lot of time.
es: Si se pasa, la construcción Redis será testeada. Esto puede tardar mucho tiempo.

source: Checking pacapt
es: Comprobando pacapt

source: Retrieving latest version
es: Obteniendo última versión

source: Installed
es: Instalado

source: Found installed
es: Encontrado instalado

source: Updated
es: Actualizado

source: Destination file exists
es: El archivo de destino ya existe

source: Indicate another destination for pacapt with parameter
es: Indica otro destino para pacapt con el parámetro

source: Downloads pacapt.
es: Descarga pacapt.

source: Destination path of the downloaded binary. By default '$_DEST_PATH'.
es: Ruta de destino del binario descargado. Por defecto '$_DEST_PATH'.

source: An error happen retrieving shunit2 releases information from Github API.
es: Ocurrió un error obteniendo la información de las releases de shunit2 de la API de Github.

source: Checking shunit2...
es: Comprobando shunit2...

source: Retrieving lastest version...
es: Obteniendo la última version...

source: An error happen parsing lastest shunit2 release version from Github API.
es: Ocurrió un error parseando la versión de la última release de shunit2 de la API de Github.

source: Downloading shunit2
es: Descargando shunit2

source: An error happen downloading shunit2
es: Ocurrió un error descargando shunit2

source: Indicate another destination for shunit2 with parameter
es: Indica otro destino para shunit2 con el parámetro

source: Downloads shunit2.
es: Descarga shunit2.

source: Updating system packages...
es: Actualizando paquetes del sistema...

source: Updates and optionally upgrades the system if their repository packages have not been updated today.
es: Actualiza los paquetes y, opcionalmente, actualiza el sitema si sus paquetes de repositorio no han sido actualizados hoy.

source: Passing this option, if the system has not been updated today, will be upgraded also.
es: Pasando esta opción, si el sistema no ha sido actualizado hoy, también será actualizado.

source: Leaving ports free of processes...
es: Dejando puertos libres de procesos.

source: Kills all the processes running in the system that are using the ports specified with the parameter '--ports'.
es: Mata todos los procesos ejecutándose en el sistema que están usando los puertos especificados con el parámetro '--ports'.

source: List of ports separated by commas which process will be terminated.
es: Lista de puertos separados por comas cuyos procesos serán terminados.

source: Setting boot timeout for Grub
es: Definiendo tiempo de expiración de arranque para Grub

source: Grub configuration file not found
es: Archivo de configuración de Grub no encontrado

source: Defines a new timeout for GRUB boot prompt.
es: Define un nuevo tiempo de expiración para el indicador de arranque de GRUB.

source: New timeout for the GRUB boot prompt, in seconds. By default $_NEW_TIMEOUT seconds.
es: Nuevo tiempo de expiración para el indicador de arranque de GRUB, en segundos. Por defecto $_NEW_TIMEOUT segundos.

source: Exposes information about the distibution of the system. This script must be sourced.
es: Expone información sobre la distribución del sistema. Este script debe ser ejecutado con 'source'.

source: You can check the information of the distribution in the next exposed environment variables:
es: Puedes comprobar la información de la distribución con las siguientes variables de entorno expuestas:

source: - 'UNIX_DISTRO': Lowercased distribution identificator name. For example: 'ubuntu'.
es: - 'UNIX_DISTRO': Nombre identificador de la distribución en minúsculas. Por ejemplo: 'ubuntu'.

source: - 'UNIX_DISTRO_CAPITALIZED': Capitalized distribution identificator name. For example: 'Ubuntu'.
es: - 'UNIX_DISTRO_CAPITALIZED': Nombre identificador de la distribución con la primera letra en mayúscula. Por ejemplo: 'Ubuntu'.

source: - 'UNIX_DISTRO_VERSION_NAME': Lowercased distribution version name. For example: 'focal'.
es: - 'UNIX_DISTRO_VERSION_NAME': Nombre de versión de la distribución en minúsculas. Por ejemplo: 'focal'.

source: - 'UNIX_DISTRO_VERSION_NUMBER': Destribution version number. For example: '20.04'.
es: - 'UNIX_DISTRO_VERSION_NUMBER': Número de versión de la distribución. Por ejemplo: '20.04'.

source: - 'UNIX_DISTRO_VERSION_NUMBER_MAJOR': Distribution major version number. For example: '20'.
es: - 'UNIX_DISTRO_VERSION_NUMBER_MAJOR': Número de versión mayor de la distribución. Por ejemplo: '20'.

source: - 'UNIX_DISTRO_VERSION_NUMBER_MINOR': Distribution minor version number. For example: '04'.
es: - 'UNIX_DISTRO_VERSION_NUMBER_MINOR': Número de versión menor de la distribución. Por ejemplo: '04'.

source: You must specify an address with the parameter
es: Debes especificar una dirección con el parámetro

source: Check if a TCP address is operative through HTTP using curl.
es: Comprueba si una dirección TCP está operativa mediante HTTP usando curl.

source: URL to check if it is operative.
es: URL a comprobar si está operativa.

source: Maximum number of attemps checking if the provided address is operative. As default 40.
es: Número máximo de intentos comprobando si la dirección provista está operativa. Por defecto 40.

source: Number of seconds to wait between attempts. As default 1.
es: Número de segundos a esperar entre intentos. Por defecto 1.

source: String outputted passing it to printf between attemps (before wait).
es: Cadena mostrada pasándola a printf entre intentos (antes de esperar)

source: Perform insecure SSL connection (passes the option '--insecure' to the curl command).
es: Realiza una conexión SSL insegura (pasa la opción '--insecure' al comando curl)

source: Usage:
es: Uso:

source: Options:
es: Opciones:

source: Show this help message and exit.
es: Muestra este mensaje de ayuda y termina.

source: Each line of the script output will be preceded with the string defined in this parameter.
es: Cada línea de salida del script será precedida con la cadena definida en este parámetro.
