Repository: mondeja/shread
Catalog: src/unix/_/customize/text-editor/atom/*.po
Languages: es

source: This script needs to be executed as superuser.
es: Este script necesita ser ejecutado como superusuario.

source: Atom is not installed for local user
es: Atom no está instalado para el usuario local

source: The directory '$HOME/.atom' doesn't exists.
es: El directorio '$HOME/.atom' no existe.

source: NodeJS needs to be installed before customize Atom.
es: NodeJS necesita estar instalado antes de personalizar Atom.

source: Customizing Atom text editor
es: Personalizando el editor de textos Atom

source: Checking Atom packages installed...
es: Comprobando paquetes de Atom instalados...

source: Setting up editor...
es: Configurando el editor...

source: Disabling incompatible packages...
es: Deshabilitando paquetes incompatibles...

source: An error happen installing the Atom package
es: Ocurrió un error instalando paquete de Atom

source: An error happen disabling the Atom package
es: Ocurrió un error deshabilitando el paquete de Atom
